Revit 2027 API
Transform1D.AlmostEqual Method
 Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AlmostEqual(
	Transform1D right
)
Public Function AlmostEqual (
	right As Transform1D
) As Boolean
public:
bool AlmostEqual(
	Transform1D^ right
)
member AlmostEqual :
        right : Transform1D -> bool
Parameters
right Transform1D
 The transformation to compare with this transformation.
Return Value
Boolean
 True if the two transformations are equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The tolerance is applied memberwise for comparison.
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace